[
  {
    "path": "posts/2022-04-22-day-2-on-422/",
    "title": "Day 2 on 4.22",
    "description": "An Earth Day post, and more.",
    "author": [
      {
        "name": "Juan David Acosta",
        "url": {}
      }
    ],
    "date": "2022-04-22",
    "categories": [],
    "contents": "\r\n (Photo by Akil Mazumder: https://www.pexels.com/photo/person-holding-a-green-plant-1072824/)\r\nToday is Earth Day. A day when we reflect upon the state of our planet. With the climate crisis we are facing today, it can seem that the future is bleak, especially for the young generations that will face the brunt force of a warmer planet. However, I would like to highlight the positives, the reasons to have hope that, while we may not be able to prevent all the consequences of climate change, we can at least unite together to mitigate the most harmful outcomes. We have become more conscious of our impact on the well-being of Earth’s diverse biosphere, and are taking steps to help in any way we can to reduce that impact, whether it be buying an electric vehicle, shopping with reusable bags, planting trees, recycling, etc. It is not futile. It is not too late. Through hope and action, we can help preserve the only planet that we call home, Earth.\r\nPivoting from Earth Day, I have decided to continue posting at least one blog a day, every day! There are no guarantees for this, but I am striving to keep this up as not only an exercise in writing, but also in communicating my thoughts and ideas to the world. Thus, it will be an integral part of this website. And speaking of the website, major progress has been made in building out the rest of the website’s sections. Of course, this will be a continuing endeavour as time progresses.\r\nThat’s a wrap for this post!\r\n\r\n\r\n\r\n",
    "preview": "posts/2022-04-22-day-2-on-422/pexels-akil-mazumder-1072824.jpg",
    "last_modified": "2022-04-22T16:46:00-04:00",
    "input_file": {}
  },
  {
    "path": "posts/2022-04-21-the-birth-of-a-website/",
    "title": "The birth of a website",
    "description": "From concept to reality.",
    "author": [
      {
        "name": "Juan David Acosta",
        "url": {}
      }
    ],
    "date": "2022-04-21",
    "categories": [],
    "contents": "\r\nBuilding a website seems to be one of the fundamental basics that one must have at this point in the 21st century. A website for your business. A website for your portfolio of projects. I had attempted to make websites in the past, mostly for the times I had considered becoming a content creator, or when I fell for the allure and ease-of-use of Apple’s iWeb (this is where I date myself), but those endeavours quickly fell apart. It was a combination of no clear focus for those websites, and the amount of time that I would have to spend on them.\r\nNow, however, I have found a purpose for building a website. I am looking to break ground on my future career as a data analyst or data scientist, and it is imperative to have a central, aesthetically-pleasing looking place to highlight my projects and competencies, as well as my thoughts (like through this here blog) and ways to get in contact with me. Thus, a website is a must. And, with my intermediate knowledge of R and RStudio, what better way to put that knowledge into practice than by building a website using both R and RStudio?\r\nThus, this journey started. After consulting various articles and tutorials (that will eventually be linked here once the site is a bit more polished), the website has officially made its internet debut! There’s nothing too fancy here at the moment, but it shall soon be filled to the brim with more blog posts, projects (such as my educational projects and Tidy Tuesday submissions), biography, contact information, etc. So please, grab some snacks and drinks that I’ve set out on the table there, and take a look around!\r\n\r\n\r\n\r\n",
    "preview": {},
    "last_modified": "2022-04-21T18:25:52-04:00",
    "input_file": {}
  }
]
